### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

In [2]:
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

In [3]:
# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [4]:
total_players = purchase_data['SN'].nunique()
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
unique_items = purchase_data['Item Name'].nunique()
unique_items

179

In [6]:
average_items = round(purchase_data['Price'].mean(),2)
average_items

3.05

In [7]:
purchase_count = len(purchase_data['Purchase ID'])
purchase_count

780

In [8]:
total_revenue = purchase_data['Price'].sum()
total_revenue

2379.77

In [9]:
format_revenue = "{:,.2f}".format((total_revenue))
format_revenue

'2,379.77'

In [10]:
purchase_analysis = pd.DataFrame({"Number of Unique Items": [unique_items],
                                  "Average Price": "$"+str(average_items),
                                  "Number of Purchases": [purchase_count],
                                  "Total Revenue": "$"+str(format_revenue)})
purchase_analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
revised_purchase_list = purchase_data[["SN","Gender"]]
revised_purchase_list

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [12]:
revised_purchase_list = revised_purchase_list.drop_duplicates()
revised_purchase_list

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [13]:
gender_counts = revised_purchase_list['Gender'].value_counts()
gender_counts

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
male_counts =  gender_counts['Male']
female_counts = gender_counts['Female']
other_counts = gender_counts['Other / Non-Disclosed']

In [15]:
male_percentage =  "{:,.2%}".format(male_counts / total_players)
female_percentage = "{:,.2%}".format(female_counts / total_players)
other_percentage =  "{:,.2%}".format(other_counts / total_players)
# other_percentage

In [16]:
gender_percentage = (male_percentage), (female_percentage), (other_percentage)
gender_percentage

('84.03%', '14.06%', '1.91%')

In [17]:
gender_index = pd.DataFrame(gender_counts)
gender_index = gender_index.rename(
    columns={"Gender": "Total Count"})
gender_index

                       Total Count
Male                           484
Female                          81
Other / Non-Disclosed           11

In [18]:
gender_index["Percentage of Players"] = gender_percentage
gender_index

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [19]:
full_gender_count = purchase_data['Gender'].value_counts()
full_gender_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [20]:
fem_purchase_data = purchase_data.loc[purchase_data['Gender'] =="Female"]
male_purchase_data = purchase_data.loc[purchase_data['Gender'] =="Male"]
other_purchase_data = purchase_data.loc[purchase_data['Gender'] =="Other / Non-Disclosed"]

In [21]:
fem_purchase_count = len(fem_purchase_data['Purchase ID'])
fem_total_revenue = fem_purchase_data['Price'].sum()
fem_average_item = "$"+"{:,.2f}".format(fem_total_revenue/fem_purchase_count)
fem_average_revised = "$"+"{:,.2f}".format(fem_total_revenue/female_counts)
format_fem_revenue = "$"+"{:,.2f}".format(fem_total_revenue)
fem_average_revised

'$4.47'

In [22]:
male_purchase_count = len(male_purchase_data['Purchase ID'])
male_total_revenue = male_purchase_data['Price'].sum()
male_average_item ="$"+"{:,.2f}".format(male_total_revenue/male_purchase_count)
male_average_revised ="$"+"{:,.2f}".format(male_total_revenue/male_counts)
format_male_revenue = "$"+"{:,.2f}".format(male_total_revenue)
male_average_revised

'$4.07'

In [23]:
other_purchase_count = len(other_purchase_data['Purchase ID'])
other_total_revenue = other_purchase_data['Price'].sum()
other_average_item = "$"+"{:,.2f}".format(other_total_revenue/other_purchase_count)
other_average_revised = "$"+"{:,.2f}".format(other_total_revenue/other_counts)
format_other_revenue = "$"+"{:,.2f}".format(other_total_revenue)
other_average_revised

'$4.56'

In [24]:
combined_average_price = (fem_average_item), (male_average_item), (other_average_item)
combined_total_revenue = (format_fem_revenue), (format_male_revenue), (format_other_revenue)
combined_revised_average = (fem_average_revised), (male_average_revised), (other_average_revised)
combined_revised_average

('$4.47', '$4.07', '$4.56')

In [25]:
gender_analysis = purchase_data.groupby('Gender')
gender_purchase_df = gender_analysis.count()
gender_purchase_df

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [26]:
gender_purchase_analysis = gender_purchase_df[['Purchase ID']]
gender_purchase_analysis = gender_purchase_analysis.rename(columns ={"Purchase ID" : "Purchase Count"})
gender_purchase_analysis

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [27]:
gender_purchase_analysis["Average Purchase Price"] = combined_average_price
gender_purchase_analysis["Total Purchase Value"] = combined_total_revenue
gender_purchase_analysis['Avg Total Purchase per Person'] = combined_revised_average
gender_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [28]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9,39.9, 100]
age_range =["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [29]:
revised_age_data = purchase_data[["SN","Age","Gender"]]
revised_age_data = revised_age_data.drop_duplicates()
revised_age_data

                SN  Age  Gender
0          Lisim78   20    Male
1      Lisovynya38   40    Male
2       Ithergue48   24    Male
3    Chamassasya86   24    Male
4        Iskosia90   23    Male
..             ...  ...     ...
773         Hala31   21    Male
774     Jiskjask80   11    Male
775     Aethedru70   21  Female
777     Yathecal72   20    Male
778        Sisur91    7    Male

[576 rows x 3 columns]

In [30]:
revised_age_data["Age Range"] = pd.cut(revised_age_data["Age"], bins, labels=age_range, include_lowest=True)
revised_age_data

                SN  Age  Gender Age Range
0          Lisim78   20    Male     20-24
1      Lisovynya38   40    Male       40+
2       Ithergue48   24    Male     20-24
3    Chamassasya86   24    Male     20-24
4        Iskosia90   23    Male     20-24
..             ...  ...     ...       ...
773         Hala31   21    Male     20-24
774     Jiskjask80   11    Male     10-14
775     Aethedru70   21  Female     20-24
777     Yathecal72   20    Male     20-24
778        Sisur91    7    Male       <10

[576 rows x 4 columns]

In [31]:
new_age_data = revised_age_data[["Age","Age Range"]]
new_age_data

     Age Age Range
0     20     20-24
1     40       40+
2     24     20-24
3     24     20-24
4     23     20-24
..   ...       ...
773   21     20-24
774   11     10-14
775   21     20-24
777   20     20-24
778    7       <10

[576 rows x 2 columns]

In [32]:
sort_age_data = new_age_data.sort_values("Age Range")
sort_age_data

     Age Age Range
778    7       <10
446    7       <10
81     8       <10
33     7       <10
37     8       <10
..   ...       ...
667   40       40+
477   41       40+
674   43       40+
761   45       40+
728   44       40+

[576 rows x 2 columns]

In [33]:
new_index_data = sort_age_data.reset_index(drop=True)
new_index_data

     Age Age Range
0      7       <10
1      7       <10
2      8       <10
3      7       <10
4      8       <10
..   ...       ...
571   40       40+
572   41       40+
573   43       40+
574   45       40+
575   44       40+

[576 rows x 2 columns]

In [34]:
age_analysis = new_index_data.groupby('Age Range')
age_purchase_analysis = age_analysis.count()
age_purchase_analysis

           Age
Age Range
<10         17
10-14       22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40+         12

In [35]:
age_purchase_analysis = age_purchase_analysis.rename(columns ={"Age" : "Total Count"})
age_purchase_analysis

           Total Count
Age Range
<10                 17
10-14               22
15-19              107
20-24              258
25-29               77
30-34               52
35-39               31
40+                 12

In [36]:
total_count_age = age_purchase_analysis['Total Count']
under_ten = total_count_age['<10']
ten_to_fourteen = total_count_age['10-14']
fift_to_ninet = total_count_age['15-19']
twent_to_twentf = total_count_age['20-24']
twentf_to_twentn = total_count_age['25-29']
thirt_to_thirtf = total_count_age['30-34']
thirtf_to_thirtn = total_count_age['35-39']
plus_fort = total_count_age['40+']

In [37]:
percentage_of_players = [("{:,.2%}".format(under_ten/total_players)),
                         ("{:,.2%}".format(ten_to_fourteen/total_players)),
                         ("{:,.2%}".format(fift_to_ninet/total_players)),
                         ("{:,.2%}".format(twent_to_twentf/total_players)),
                         ("{:,.2%}".format(twentf_to_twentn/total_players)),
                         ("{:,.2%}".format(thirt_to_thirtf/total_players)),
                         ("{:,.2%}".format(thirtf_to_thirtn/total_players)),
                         ("{:,.2%}".format(plus_fort/total_players))]
percentage_of_players

['2.95%', '3.82%', '18.58%', '44.79%', '13.37%', '9.03%', '5.38%', '2.08%']

In [38]:
age_purchase_analysis['Percentage of Players'] = percentage_of_players
age_purchase_analysis

           Total Count Percentage of Players
Age Range
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [39]:
full_purchase_data = purchase_data[['Age']]
full_purchase_data

     Age
0     20
1     40
2     24
3     24
4     23
..   ...
775   21
776   21
777   20
778    7
779   24

[780 rows x 1 columns]

In [40]:
full_purchase_data["Age Range"] = pd.cut(full_purchase_data["Age"], bins, labels=age_range, include_lowest=True)
full_purchase_data

C:\Users\16129\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

     Age Age Range
0     20     20-24
1     40       40+
2     24     20-24
3     24     20-24
4     23     20-24
..   ...       ...
775   21     20-24
776   21     20-24
777   20     20-24
778    7       <10
779   24     20-24

[780 rows x 2 columns]

In [41]:
sort_full_data = full_purchase_data.sort_values('Age Range')
# sorted_data = sort_full_data['Age Range'].value_counts()
sorted_data = sort_full_data.reset_index(drop=True)
sorted_data

     Age Age Range
0      9       <10
1      8       <10
2      7       <10
3      7       <10
4      8       <10
..   ...       ...
775   40       40+
776   44       40+
777   45       40+
778   40       40+
779   41       40+

[780 rows x 2 columns]

In [42]:
sorted_data_count = sorted_data.groupby('Age Range')
spend_analysis = sorted_data_count.count()
spend_analysis

           Age
Age Range
<10         23
10-14       28
15-19      136
20-24      365
25-29      101
30-34       73
35-39       41
40+         13

In [43]:
spend_analysis = spend_analysis.rename(columns ={"Age" : "Purchase Count"})
spend_analysis

           Purchase Count
Age Range
<10                    23
10-14                  28
15-19                 136
20-24                 365
25-29                 101
30-34                  73
35-39                  41
40+                    13

In [44]:
under_ten_purchase_data = purchase_data.loc[purchase_data['Age'] < 10]
ten_fort_purchase_data = purchase_data.loc[(purchase_data['Age'] > 9) & (purchase_data['Age'] < 15)]
fift_ninet_purchase_data = purchase_data.loc[(purchase_data['Age'] > 14) & (purchase_data['Age'] < 20)]
twent_twentf_purchase_data = purchase_data.loc[(purchase_data['Age'] > 19) & (purchase_data['Age'] < 25)]
twentf_twentn_purchase_data = purchase_data.loc[(purchase_data['Age'] > 24) & (purchase_data['Age'] < 30)]
thirt_thirtf_purchase_data = purchase_data.loc[(purchase_data['Age'] > 29) & (purchase_data['Age'] < 35)]
thirtf_thirtn_purchase_data = purchase_data.loc[(purchase_data['Age'] > 34) & (purchase_data['Age'] < 40)]
fort_purchase_data = purchase_data.loc[(purchase_data['Age'] > 39)]
fort_purchase_data.count()

Purchase ID    13
SN             13
Age            13
Gender         13
Item ID        13
Item Name      13
Price          13
dtype: int64

In [45]:
under_ten_age_data = revised_age_data.loc[revised_age_data['Age'] < 10]
ten_fort_age_data = revised_age_data.loc[(revised_age_data['Age'] > 9) & (revised_age_data['Age'] < 15)]
fift_ninet_age_data = revised_age_data.loc[(revised_age_data['Age'] > 14) & (revised_age_data['Age'] < 20)]
twent_twentf_age_data = revised_age_data.loc[(revised_age_data['Age'] > 19) & (revised_age_data['Age'] < 25)]
twentf_twentn_age_data = revised_age_data.loc[(revised_age_data['Age'] > 24) & (revised_age_data['Age'] < 30)]
thirt_thirtf_age_data = revised_age_data.loc[(revised_age_data['Age'] > 29) & (revised_age_data['Age'] < 35)]
thirtf_thirtn_age_data = revised_age_data.loc[(revised_age_data['Age'] > 34) & (revised_age_data['Age'] < 40)]
fort_age_data = revised_age_data.loc[(revised_age_data['Age'] > 39)]
fort_age_data

               SN  Age  Gender Age Range
1     Lisovynya38   40    Male       40+
23       Eyrian71   40    Male       40+
220    Jiskjask85   40    Male       40+
248    Isursuir31   44    Male       40+
341   Hiasurria41   41    Male       40+
477    Mindossa76   41    Male       40+
480     Salilis27   40    Male       40+
557    Frichaya88   42    Male       40+
667     Inasuir29   40  Female       40+
674       Aeral68   43    Male       40+
728  Chanosiaya39   44    Male       40+
761       Assim27   45    Male       40+

In [46]:
under_ten_purchase_count = len(under_ten_purchase_data['Purchase ID'])
under_ten_revised_count = len(under_ten_age_data['Age'])
under_ten_total_revenue = under_ten_purchase_data['Price'].sum()
under_ten_average_item = "$"+"{:,.2f}".format(under_ten_total_revenue/under_ten_purchase_count)
revised_under_ten_average = "$"+"{:,.2f}".format(under_ten_total_revenue/under_ten_revised_count)
format_under_ten_revenue = "$"+"{:,.2f}".format(under_ten_total_revenue)
revised_under_ten_average

'$4.54'

In [47]:
ten_fort_purchase_count = len(ten_fort_purchase_data['Purchase ID'])
ten_fort_revised_count = len(ten_fort_age_data['Age'])
ten_fort_total_revenue = ten_fort_purchase_data['Price'].sum()
ten_fort_average_item = "$"+"{:,.2f}".format(ten_fort_total_revenue/ten_fort_purchase_count)
revised_ten_fort_average = "$"+"{:,.2f}".format(ten_fort_total_revenue/ten_fort_revised_count)
format_ten_fort_revenue = "$"+"{:,.2f}".format(ten_fort_total_revenue)
format_ten_fort_revenue

'$82.78'

In [48]:
fift_ninet_purchase_count = len(fift_ninet_purchase_data['Purchase ID'])
fift_ninet_revised_count = len(fift_ninet_age_data['Age'])
fift_ninet_total_revenue = fift_ninet_purchase_data['Price'].sum()
fift_ninet_average_item = "$"+"{:,.2f}".format(fift_ninet_total_revenue/fift_ninet_purchase_count)
revised_fift_ninet_average = "$"+"{:,.2f}".format(fift_ninet_total_revenue/fift_ninet_revised_count)
format_fift_ninet_revenue = "$"+"{:,.2f}".format(fift_ninet_total_revenue)
format_fift_ninet_revenue

'$412.89'

In [49]:
twent_twentf_purchase_count = len(twent_twentf_purchase_data['Purchase ID'])
twent_twentf_revised_count = len(twent_twentf_age_data['Age'])
twent_twentf_total_revenue = twent_twentf_purchase_data['Price'].sum()
twent_twentf_average_item = "$"+"{:,.2f}".format(twent_twentf_total_revenue/twent_twentf_purchase_count)
revised_twent_twentf_average = "$"+"{:,.2f}".format(twent_twentf_total_revenue/twent_twentf_revised_count)
format_twent_twentf_revenue = "$"+"{:,.2f}".format(twent_twentf_total_revenue)
format_twent_twentf_revenue

'$1,114.06'

In [50]:
twentf_twentn_purchase_count = len(twentf_twentn_purchase_data['Purchase ID'])
twentf_twentn_revised_count = len(twentf_twentn_age_data['Age'])
twentf_twentn_total_revenue = twentf_twentn_purchase_data['Price'].sum()
twentf_twentn_average_item = "$"+"{:,.2f}".format(twentf_twentn_total_revenue/twentf_twentn_purchase_count)
revised_twentf_twentn_average = "$"+"{:,.2f}".format(twentf_twentn_total_revenue/twentf_twentn_revised_count)
format_twentf_twentn_revenue = "$"+"{:,.2f}".format(twentf_twentn_total_revenue)
format_twentf_twentn_revenue

'$293.00'

In [51]:
thirt_thirtf_purchase_count = len(thirt_thirtf_purchase_data['Purchase ID'])
thirt_thirtf_revised_count = len(thirt_thirtf_age_data['Age'])
thirt_thirtf_total_revenue = thirt_thirtf_purchase_data['Price'].sum()
thirt_thirtf_average_item = "$"+"{:,.2f}".format(thirt_thirtf_total_revenue/thirt_thirtf_purchase_count)
revised_thirt_thirtf_average = "$"+"{:,.2f}".format(thirt_thirtf_total_revenue/thirt_thirtf_revised_count)
format_thirt_thirtf_revenue = "$"+"{:,.2f}".format(thirt_thirtf_total_revenue)
format_thirt_thirtf_revenue

'$214.00'

In [52]:
thirtf_thirtn_purchase_count = len(thirtf_thirtn_purchase_data['Purchase ID'])
thirtf_thirtn_revised_count = len(thirtf_thirtn_age_data['Age'])
thirtf_thirtn_total_revenue = thirtf_thirtn_purchase_data['Price'].sum()
thirtf_thirtn_average_item = "$"+"{:,.2f}".format(thirtf_thirtn_total_revenue/thirtf_thirtn_purchase_count)
revised_thirtf_thirtn_average = "$"+"{:,.2f}".format(thirtf_thirtn_total_revenue/thirtf_thirtn_revised_count)
format_thirtf_thirtn_revenue = "$"+"{:,.2f}".format(thirtf_thirtn_total_revenue)
format_thirtf_thirtn_revenue

'$147.67'

In [53]:
fort_purchase_count = len(fort_purchase_data['Purchase ID'])
fort_revised_count = len(fort_age_data['Age'])
fort_total_revenue = fort_purchase_data['Price'].sum()
fort_average_item = "$"+"{:,.2f}".format(fort_total_revenue/fort_purchase_count)
revised_fort_average = "$"+"{:,.2f}".format(fort_total_revenue/fort_revised_count)
format_fort_revenue = "$"+"{:,.2f}".format(fort_total_revenue)
fort_total_revenue

38.24

In [54]:
age_average_price = ((under_ten_average_item), (ten_fort_average_item), (fift_ninet_average_item), 
                    (twent_twentf_average_item), (twentf_twentn_average_item), (thirt_thirtf_average_item),
                    (thirtf_thirtn_average_item), (fort_average_item))
age_average_price

('$3.35', '$2.96', '$3.04', '$3.05', '$2.90', '$2.93', '$3.60', '$2.94')

In [55]:
revised_age_average_price = ((revised_under_ten_average), (revised_ten_fort_average), (revised_fift_ninet_average), 
                    (revised_twent_twentf_average), (revised_twentf_twentn_average), (revised_thirt_thirtf_average),
                    (revised_thirtf_thirtn_average), (revised_fort_average))
revised_age_average_price

('$4.54', '$3.76', '$3.86', '$4.32', '$3.81', '$4.12', '$4.76', '$3.19')

In [56]:
age_total_revenue = ((format_under_ten_revenue), (format_ten_fort_revenue), (format_fift_ninet_revenue),
                     (format_twent_twentf_revenue), (format_twentf_twentn_revenue), (format_thirt_thirtf_revenue),
                     (format_thirtf_thirtn_revenue), (format_fort_revenue))
age_total_revenue

('$77.13',
 '$82.78',
 '$412.89',
 '$1,114.06',
 '$293.00',
 '$214.00',
 '$147.67',
 '$38.24')

In [57]:
spend_analysis['Average Purchase Price'] = age_average_price
spend_analysis['Total Purchase Value'] = age_total_revenue
spend_analysis['Avg Total Purchase per Person'] = revised_age_average_price
spend_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Range,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [58]:
sn_df = purchase_data.loc[(purchase_data['SN'] == "Lisosia93") |
                          (purchase_data['SN'] == "Idastidru52") |
                          (purchase_data['SN'] == "Chamjask73") |
                          (purchase_data['SN'] == "Iral74") |
                          (purchase_data['SN'] == "Iskadarya95")]
sn_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
74,74,Lisosia93,25,Male,89,"Blazefury, Protector of Delusions",4.64
120,120,Lisosia93,25,Male,24,Warped Fetish,3.81
128,128,Iral74,21,Male,58,"Freak's Bite, Favor of Holy Might",4.14
148,148,Iskadarya95,20,Male,148,"Warmonger, Gift of Suffering's End",4.03
222,222,Chamjask73,22,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23
224,224,Lisosia93,25,Male,157,"Spada, Etcher of Hatred",4.80
247,247,Iskadarya95,20,Male,82,Nirvana,4.90
290,290,Idastidru52,24,Male,147,"Hellreaver, Heirloom of Inception",4.93
318,318,Iskadarya95,20,Male,91,Celeste,4.17
490,490,Idastidru52,24,Male,148,"Warmonger, Gift of Suffering's End",4.03
520,520,Chamjask73,22,Female,109,"Downfall, Scalpel Of The Emperor",4.76
543,543,Idastidru52,24,Male,121,Massacre,1.60
564,564,Chamjask73,22,Female,52,Hatred,4.84
603,603,Lisosia93,25,Male,132,Persuasion,3.19
609,609,Lisosia93,25,Male,40,Second Chance,2.52
623,623,Iral74,21,Male,114,Yearning Mageblade,3.82
676,676,Idastidru52,24,Male,111,Misery's End,4.89
758,758,Iral74,21,Male,182,Toothpick,4.03
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63

In [59]:
liso_data = sn_df.loc[sn_df['SN'] == "Lisosia93"]
liso_count = len(liso_data['SN'])
liso_sum = liso_data['Price'].sum()
liso_average = "$"+"{:,.2f}".format(liso_sum/liso_count)
liso_format_sum = "$"+"{:,.2f}".format(liso_sum)
liso_format_sum

'$18.96'

In [60]:
idas_data = sn_df.loc[sn_df['SN'] == "Idastidru52"]
idas_count = len(idas_data['SN'])
idas_sum = idas_data['Price'].sum()
idas_average = "$"+"{:,.2f}".format(idas_sum/idas_count)
idas_format_sum = "$"+"{:,.2f}".format(idas_sum)
idas_format_sum

'$15.45'

In [61]:
cham_data = sn_df.loc[sn_df['SN'] == "Chamjask73"]
cham_count = len(cham_data['SN'])
cham_sum = cham_data['Price'].sum()
cham_average = "$"+"{:,.2f}".format(cham_sum/cham_count)
cham_format_sum = "$"+"{:,.2f}".format(cham_sum)
cham_format_sum

'$13.83'

In [62]:
iral_data = sn_df.loc[sn_df['SN'] == "Iral74"]
iral_count = len(iral_data['SN'])
iral_sum = iral_data['Price'].sum()
iral_average = "$"+"{:,.2f}".format(iral_sum/iral_count)
iral_format_sum = "$"+"{:,.2f}".format(iral_sum)
iral_format_sum

'$13.62'

In [63]:
iska_data = sn_df.loc[sn_df['SN'] == "Iskadarya95"]
iska_count = len(iska_data['SN'])
iska_sum = iska_data['Price'].sum()
iska_average = "$"+"{:,.2f}".format(iska_sum/iska_count)
iska_format_sum = "$"+"{:,.2f}".format(iska_sum)
iska_format_sum

'$13.10'

In [64]:
slim_sn_df = sn_df[['SN','Purchase ID']]
slim_sn_df

              SN  Purchase ID
74     Lisosia93           74
120    Lisosia93          120
128       Iral74          128
148  Iskadarya95          148
222   Chamjask73          222
224    Lisosia93          224
247  Iskadarya95          247
290  Idastidru52          290
318  Iskadarya95          318
490  Idastidru52          490
520   Chamjask73          520
543  Idastidru52          543
564   Chamjask73          564
603    Lisosia93          603
609    Lisosia93          609
623       Iral74          623
676  Idastidru52          676
758       Iral74          758
776       Iral74          776

In [65]:
sorted_sn_count = slim_sn_df.groupby('SN')
sorted_sn = sorted_sn_count.count()
sorted_sn = sorted_sn.rename(columns ={"Purchase ID" : "Purchase Count"})
sorted_sn

             Purchase Count
SN
Chamjask73                3
Idastidru52               4
Iral74                    4
Iskadarya95               3
Lisosia93                 5

In [66]:
average_sn_price = (cham_average), (idas_average),(iral_average),(iska_average),(liso_average)
total_sn = (cham_format_sum), (idas_format_sum), (iral_format_sum), (iska_format_sum),(liso_format_sum)
total_sn

('$13.83', '$15.45', '$13.62', '$13.10', '$18.96')

In [67]:
sorted_sn['Average Purchase Price'] = average_sn_price
sorted_sn['Total Purchase Value'] = total_sn
sorted_sn

             Purchase Count Average Purchase Price Total Purchase Value
SN
Chamjask73                3                  $4.61               $13.83
Idastidru52               4                  $3.86               $15.45
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10
Lisosia93                 5                  $3.79               $18.96

In [68]:
new_sorted_sn = sorted_sn.sort_values('Total Purchase Value', ascending=False)
new_sorted_sn

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [69]:
item_data = purchase_data[['Item ID', 'Item Name', 'Price']]
item_data

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [70]:
revised_item_data = item_data.loc[(item_data['Item Name'] == 'Final Critic')|
                                  (item_data['Item Name'] == 'Oathbreaker, Last Hope of the Breaking Storm')|
                                  (item_data['Item Name'] == 'Fiery Glass Crusader')|
                                  (item_data['Item Name'] == 'Persuasion')|
                                  (item_data['Item Name'] == 'Extraction, Quickblade Of Trembling Hands')]
revised_item_data.head(20)

     Item ID                                     Item Name  Price
0        108     Extraction, Quickblade Of Trembling Hands   3.53
2         92                                  Final Critic   4.88
24       132                                    Persuasion   3.19
25       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
56       108     Extraction, Quickblade Of Trembling Hands   3.53
61       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
62       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
72       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
98       132                                    Persuasion   3.19
99        92                                  Final Critic   4.19
132      145                          Fiery Glass Crusader   4.58
157      108     Extraction, Quickblade Of Trembling Hands   3.53
207      145                          Fiery Glass Crusader   4.58
222      178  Oathbreaker, Last Hope of the Breaking Storm   4.23
252       92                                  Final Critic   4.88
261      132                                    Persuasion   3.19
273       92                                  Final Critic   4.88
277       92                                  Final Critic   4.88
329      145                          Fiery Glass Crusader   4.58
411       92                                  Final Critic   4.19

In [71]:
mean_price = revised_item_data.groupby('Item ID')
mean_item_price = mean_price.mean()
mean_item_price

            Price
Item ID
92       4.614615
108      3.530000
132      3.221111
145      4.580000
178      4.230000

In [72]:
sort_item_data = revised_item_data.groupby('Item ID')
count_item_data = sort_item_data.count()
count_item_data

         Item Name  Price
Item ID
92              13     13
108              9      9
132              9      9
145              9      9
178             12     12

In [73]:
count_item_data = count_item_data.rename(columns ={"Item Name" : "Purchase Count"})
just_count_item = count_item_data[['Purchase Count']]
just_count_item

         Purchase Count
Item ID
92                   13
108                   9
132                   9
145                   9
178                  12

In [78]:
item_name = ("Final Critic"),('Extraction, Quickblade Of Trembling Hands'),('Persuasion'),('Fiery Glass Crusader'),('Oathbreaker, Last Hope of the Breaking Storm')
item_id = ('92'),('108'), ('132'),('145'),('178')

In [75]:
just_count_item['Item Name'] = item_name
mean_item_price['Item Name'] = item_name
mean_item_price

            Price                                     Item Name
Item ID
92       4.614615                                  Final Critic
108      3.530000     Extraction, Quickblade Of Trembling Hands
132      3.221111                                    Persuasion
145      4.580000                          Fiery Glass Crusader
178      4.230000  Oathbreaker, Last Hope of the Breaking Storm

In [109]:
merge_df = pd.merge(just_count_item, mean_item_price, on="Item Name", how='outer')
merge_df ['Item ID'] = item_id
merge_df

,Purchase Count,Item Name,Price,Item ID
0,13,Final Critic,4.614615,92
1,9,"Extraction, Quickblade Of Trembling Hands",3.530000,108
2,9,Persuasion,3.221111,132
3,9,Fiery Glass Crusader,4.580000,145
4,12,"Oathbreaker, Last Hope of the Breaking Storm",4.230000,178

In [110]:
merge_df.set_index(['Item ID', 'Item Name'], inplace=True)
merge_df

                                                      Purchase Count     Price
Item ID Item Name
92      Final Critic                                              13  4.614615
108     Extraction, Quickblade Of Trembling Hands                  9  3.530000
132     Persuasion                                                 9  3.221111
145     Fiery Glass Crusader                                       9  4.580000
178     Oathbreaker, Last Hope of the Breaking Storm              12  4.230000

In [117]:
merge_total_value = (merge_df['Purchase Count'])*(merge_df['Price'])
merge_total_value

Item ID  Item Name
92       Final Critic                                    59.99
108      Extraction, Quickblade Of Trembling Hands       31.77
132      Persuasion                                      28.99
145      Fiery Glass Crusader                            41.22
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
dtype: float64

In [120]:
merge_df['Total Purchase Value'] = merge_total_value
merge_df["Price"] = merge_df["Price"].astype(float).map("${:,.2f}".format)
merge_df["Total Purchase Value"] = merge_df["Total Purchase Value"].astype(float).map("${:,.2f}".format)
merge_df

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
132,Persuasion,9,$3.22,$28.99
145,Fiery Glass Crusader,9,$4.58,$41.22
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76

In [123]:
sort_merge_df = merge_df.sort_values('Purchase Count', ascending=False)
sort_merge_df

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
132,Persuasion,9,$3.22,$28.99
145,Fiery Glass Crusader,9,$4.58,$41.22

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame